from math import log # де log -- натуральний логарифм

RD = 91000 # Опір Rд, Ом
r_OUT = 0.09 # Зовнішній радіус, м
r_IN = 0.0055 # Внутрішній радіус, м
U0 = 9.0545 # U0, В

# Кортеж з двох елементів: радіус в м, список значень струмів в різних напрямках при цьому радіусі, мкА
Ir1 = (0.01, [79.7, 78.8, 80.7, 80.5])
Ir2 = (0.02, [])
Ir3 = (0.03, [])
Ir4 = (0.04, [])
Ir5 = (0.05, [])
Ir6 = (0.06, [])
Ir7 = (0.07, [])
Ir8 = (0.08, [])

# Функція для обрахунку теоретичної напруги (формула 5.4); Вивід: напруга в В
def theor_U(r): return (U0 / log(r_OUT/r_IN)) * log(r_OUT/r)

# Функція для обрахунку середнього арифметичного значення струму; Вивід: струм в мкА
def adr_count(Ir): return sum(Ir)/len(Ir)

# Присвоєння результату обчислення середнього арифметичного струму. Всі подані в мкА
adr_r1 = adr_count(Ir1[1])
adr_r2 = adr_count(Ir2[1])
adr_r3 = adr_count(Ir3[1])
adr_r4 = adr_count(Ir4[1])
adr_r5 = adr_count(Ir5[1])
adr_r6 = adr_count(Ir6[1])
adr_r7 = adr_count(Ir7[1])
adr_r8 = adr_count(Ir8[1])

# Присвоєння результату обчислення експериментальної напруги. Всі подані в В
u_r1 = adr_r1 * 10**(-6) * RD
u_r2 = adr_r2 * 10**(-6) * RD
u_r3 = adr_r3 * 10**(-6) * RD
u_r4 = adr_r4 * 10**(-6) * RD
u_r5 = adr_r5 * 10**(-6) * RD
u_r6 = adr_r6 * 10**(-6) * RD
u_r7 = adr_r7 * 10**(-6) * RD
u_r8 = adr_r8 * 10**(-6) * RD

# Присвоєння результату обчислення теоретичної напруги. Всі подані в В
u_theor_r1 = theor_U(Ir1[0])
u_theor_r2 = theor_U(Ir2[0])
u_theor_r3 = theor_U(Ir3[0])
u_theor_r4 = theor_U(Ir4[0])
u_theor_r5 = theor_U(Ir5[0])
u_theor_r6 = theor_U(Ir6[0])
u_theor_r7 = theor_U(Ir7[0])
u_theor_r8 = theor_U(Ir8[0])

print(f"r1 = {Ir1[0]} м: {adr_r1} мкА, U експериментальне: {u_r1:.6f} В, U теоретичне: {u_theor_r1:.6f} В")
print(f"r2 = {Ir2[0]} м: {adr_r2} мкА, U експериментальне: {u_r2:.6f} В, U теоретичне: {u_theor_r2:.6f} В")
print(f"r3 = {Ir3[0]} м: {adr_r3} мкА, U експериментальне: {u_r3:.6f} В, U теоретичне: {u_theor_r3:.6f} В")
print(f"r4 = {Ir4[0]} м: {adr_r4} мкА, U експериментальне: {u_r4:.6f} В, U теоретичне: {u_theor_r4:.6f} В")        
print(f"r5 = {Ir5[0]} м: {adr_r5} мкА, U експериментальне: {u_r5:.6f} В, U теоретичне: {u_theor_r5:.6f} В")
print(f"r6 = {Ir6[0]} м: {adr_r6} мкА, U експериментальне: {u_r6:.6f} В, U теоретичне: {u_theor_r6:.6f} В")
print(f"r7 = {Ir7[0]} м: {adr_r7} мкА, U експериментальне: {u_r7:.6f} В, U теоретичне: {u_theor_r7:.6f} В")
print(f"r8 = {Ir8[0]} м: {adr_r8} мкА, U експериментальне: {u_r8:.6f} В, U теоретичне: {u_theor_r8:.6f} В")