from math import log # де log -- натуральний логарифм

r_OUT = 0.09 # Зовнішній радіус, м
r_IN = 0.0055 # Внутрішній радіус, м

# Список значень напруг, виміряних експериментально
U_list = [
    9.054500,
    7.273175,
    4.927650,
    3.628625,
    2.675400,
    1.942850,
    1.324050,
    0.834925,
    0.384475
]

# таблиці радіуси
r0 = 0.005
r1 = 0.015
r2 = 0.025
r3 = 0.035
r4 = 0.045
r5 = 0.055
r6 = 0.065
r7 = 0.075

# Функція обчислення експериментальної напруженості ел. поля 
def E_exp(radius):

    # Я віднімаю 0.005, задля визначення значення в r = 0, 1, 2, ..., 7 (щоб потім при +1 у мене було значення в r = 1, 2, ..., 8)
    r = radius - 0.005
    return (U_list[round(r*100)] - U_list[round(r*100)+1])/0.01

# Функція опбчислення теоретичної напруженості ел. поля
def E_theor(radius):

    # Я додаю 0.005, задля визначення значення в r = 1, 2, ..., 8
    r = radius + 0.005
    return U_list[0]/(r*log(r_OUT/r_IN))

# Вивід результатів
print(f"r = {r0}, експериментальна напруженість ел. поля: {E_exp(r0):.5f}, теоретична напруженість ел. поля: {E_theor(r0):.5f}")
print(f"r = {r1}, експериментальна напруженість ел. поля: {E_exp(r1):.5f}, теоретична напруженість ел. поля: {E_theor(r1):.5f}")
print(f"r = {r2}, експериментальна напруженість ел. поля: {E_exp(r2):.5f}, теоретична напруженість ел. поля: {E_theor(r2):.5f}")
print(f"r = {r3}, експериментальна напруженість ел. поля: {E_exp(r3):.5f}, теоретична напруженість ел. поля: {E_theor(r3):.5f}")
print(f"r = {r4}, експериментальна напруженість ел. поля: {E_exp(r4):.5f}, теоретична напруженість ел. поля: {E_theor(r4):.5f}")
print(f"r = {r5}, експериментальна напруженість ел. поля: {E_exp(r5):.5f}, теоретична напруженість ел. поля: {E_theor(r5):.5f}")
print(f"r = {r6}, експериментальна напруженість ел. поля: {E_exp(r6):.5f}, теоретична напруженість ел. поля: {E_theor(r6):.5f}")
print(f"r = {r7}, експериментальна напруженість ел. поля: {E_exp(r7):.5f}, теоретична напруженість ел. поля: {E_theor(r7):.5f}")