db = {"Меркурій": (57.91, 6.083, 47.87), "Венера": (108, 93.8, 35.02), "Земля": (146.6, 108.32, 29.78),
      "Марс": (228.5, 16.318, 24.07), "Юпітер": (778.57, 143130, 13.07), "Сатурн": (1430, 82713, 9.69),
      "Уран": (2871, 6833, 6.81), "Нептун":(4500, 6254, 5.43)}

L = list(db.keys())
V = []
speed = list(db.keys())[::-1]

for x in sorted([db[key1][1] for key1 in db]):

    for key2 in db:

        if db[key2][1] == x: V.append(key2)

if __name__ == "__main__":

    print(f"Список планет від найменшої до найбільшої відстані від сонця:\n{L}\n")
    print(f"Список планет від найменшого до найбільшого об'єму:\n{V}\n")
    print(f"Список планет від найменшої до найбільшої орбітальної швидкості:\n{speed}\n")