H = 0.4 # висота h в метрах
G = 9.81 # прискорення вільного падіння

while True:

    """Ввід даних:"""
    mass = float(input("маса m: ")) # маса в кг
    r = float(input("радіус r1: ")) # радіус в метрах
    t_data = [float(x) for x in (input("виміри t: ").split(","))] # 3 виміри t в секундах

    """Розрахунок даних:"""
    t_midd = sum(t_data)/len(t_data) # середнє арифметичне значення t
    beta = 2*H/(r*t_midd**2) # бета -- кутове прискорення
    a = beta*r # a -- прискорення
    m = mass * (G - a) * r # M -- момент сили

    """Вивід результатів:"""
    print(f"<t> = {t_midd:.2f} с, beta = {beta:.2f} рад/с², a = {a:.2f} м/с², m = {m:.2f} H*кг")