from math import sqrt

#приймаю рядки значень сторін першого та другого трикутників, розділених комами
array1 = input("Введіть a1, b1, c1: ")
array2 = input("Введіть a2, b2, c2: ")

#розбиваю рядок на числа з роздільниками, кожен перетворюю в числовий тип та поміщаю у список
array1 = [float(x) for x in array1.split(',')]
array2 = [float(x) for x in array2.split(',')]

#розраховую півпериметри трикутників
p1 = sum(array1)/2
p2 = sum(array2)/2

#окремо рахую підкореневі вирази
heron_1 = p1*(p1-array1[0])*(p1-array1[1])*(p1-array1[2])
heron_2 = p2*(p2-array2[0])*(p2-array2[1])*(p2-array2[2])

if heron_1 > 0 and heron_2 > 0: #перевірка на існування трикутників із заданими сторонами
    
    #розраховую площі трикутників
    S1 = sqrt(heron_1)
    S2 = sqrt(heron_2)

    #порівнюю площі трикутників
    if S1 > S2:
        print(f"Площа першого трикутника ({S1}), більша площі другого трикутника ({S2})")
    elif S2 > S1:
        print(f"Площа другого трикутника ({S2}) більша площі першого трикутника ({S1})")
    else:
        print(f"Площа першого трикутника ({S1}) рівна площі другого трикутника ({S2})")

else:

    print("Введені значення сторін трикутника порушують головну умову існування трикутника")