t_middle_array = [

    3.59, 2.4, 1.97,
    7.38, 4.16, 3.3,
    1.6, 1.16, 0.97,
    2.73, 1.86, 1.52
]

t_array = [

    3.6, 3.63, 3.53, 2.37, 2.39, 2.45, 1.98, 1.95, 1.97,
    7.36, 7.41, 7.37, 4.23, 4.14, 4.11, 3.26, 3.32, 3.31,
    1.58, 1.6, 1.61, 1.18, 1.14, 1.17, 0.98, 0.97, 0.96,
    2.76, 2.68, 2.74, 1.88, 1.84, 1.87, 1.5, 1.53, 1.52
]

k = 12 # кількість tсер в t_middle_array
n = 36 # кількість t в t_array

T_middle = sum(t_middle_array)/k # середнє значення t_middle_array
print(f"T_middle: {T_middle:.2f}")
sum = 0

"""Обчислення дисперсії"""
for i in range(n): sum += (T_middle - t_array[i])**2
sum = (sum/(n*(n-1)))**(0.5)
print(f"result: {sum:.2f}")