# Список значень напруг, виміряних експериментально
U_exp_list = [
    7.273175,
    4.927650,
    3.628625,
    2.675400,
    1.942850,
    1.324050,
    0.834925,
    0.384475
]

# Список значень напруг, виміряних теоретично
U_theor_list = [
    7.117829,
    4.872404,
    3.558914,
    2.626979,
    1.904113,
    1.313489,
    0.814124,
    0.381554
]

# Список значень напруженості ел.поля, виміряних експериментально
E_exp_list = [
    178.13250,
    234.55250,
    129.90250,
    95.32250,
    73.25500,
    61.88000,
    48.91250,
    45.04500
]

# Список значень напруженості ел.поля, виміряних теоретично
E_theor_list = [
    323.94635,
    161.97318,
    107.98212,
    80.98659,
    64.78927,
    53.99106,
    46.27805,
    40.49329
]

eU = 0
eE = 0

# Розрахунок eU відхилень експериментальної напруги та теоретичної
for i in range(len(U_exp_list)): eU = eU + abs(U_exp_list[i] - U_theor_list[i])/U_theor_list[i]
eU = eU/len(U_exp_list) * 100

# Розрахунок eE відхилень експериментальної пруженості ел.поля та теоретичної напруги
for i in range(len(E_exp_list)): eE = eE + abs(E_exp_list[i] - E_theor_list[i])/E_theor_list[i]
eE = eE/len(E_exp_list) * 100

# Вивід розрахунків
print(f"Середнє відносне відхилення експериментальної напруги від теоретичної: {eU:.2f} %")
print(f"Середнє відносне відхилення теоретичної напруги від експериментальної: {eE:.2f} %")