U_list = [
    9.1,
    4.861675,
    3.378375,
    2.491125,
    1.817725,
    1.321775,
    0.925925,
    0.571025,
    0.266175
]

r0 = 0.015
r1 = 0.025
r2 = 0.035
r3 = 0.045
r4 = 0.055
r5 = 0.065
r6 = 0.075

def count_E(radius):

    r = radius - 0.005
    print(f"index = {int(r*100)}, value = {U_list[int(r*100)]:.5f}")
    return (U_list[int(r*100)] - U_list[int(r*100+1)])/0.01

print(f"r = {r0}, експериментальна напруженість ел. поля: {count_E(r0):.5f}")
print(f"r = {r1}, експериментальна напруженість ел. поля: {count_E(r1):.5f}")
print(f"r = {r2}, експериментальна напруженість ел. поля: {count_E(r2):.5f}")
print(f"r = {r3}, експериментальна напруженість ел. поля: {count_E(r3):.5f}")
print(f"r = {r4}, експериментальна напруженість ел. поля: {count_E(r4):.5f}")
print(f"r = {r5}, експериментальна напруженість ел. поля: {count_E(r5):.5f}")
print(f"r = {r6}, експериментальна напруженість ел. поля: {count_E(r6):.5f}")
