import numpy as np # Бібліотека numpy для обробки масивів даних
import math # Бібліотека для квадратного арифметичного кореня

# Дані з таблиці (значення R1 для 5 різних наборів)
table_R1 = np.array([
    [1584, 1485, 1393, 1449, 1708],
    [1596, 1482, 1377, 1426, 1685],
    [1605, 1485, 1391, 1398, 1710],
    [1602, 1491, 1381, 1404, 1686],
    [1608, 1462, 1386, 1399, 1656]
])

# Функція обчислення похибок для R1
def R1_mistake():

    N = 5 # Кількість вимірів
    STUDENT_COEF = 1.7 # Коефіцієнт Cтьюдента

    # Обчислення середніх значень для кожного стовпця: на виводі вектор-рядок середніх значень
    R1_means = np.mean(table_R1, axis=0)

    # Обчислення середньоквадратичної похибки для кожного стовпця
    S_Rk = np.sqrt(np.sum((table_R1 - R1_means) ** 2, axis=0) / (N * (N - 1)))

    # Обчислення середнього значення щодо середньоквадратичних похибок
    mean_S_Rk = np.mean(S_Rk)

    # Обчислення вектору відносної похибки для кожного стовпця
    mean_relivative = (S_Rk / R1_means) * 100

    # Обчислення абсолютної похибки з урахуванням коефіцієнта Cтьюдента
    absolute_result = mean_S_Rk * STUDENT_COEF

    # Середнє значення вектору відносної похибки
    relivate_result = np.mean(mean_relivative)

    # Повернення результатів
    return absolute_result, relivate_result

# Функція обчислення похибок для RX
def RX_mistake():

    # Обчислення середнього значення для всієї таблиці
    R1 = np.mean(table_R1)

    # Значення R2 та R3
    R2 = 1035.45
    R3 = 2670.30

    # Значення SR1, SR2, SR3
    SR1 = SR2 = SR3 = 45

    # Абсолютна похибка RX
    absolute_result = math.sqrt(

        (R1*SR3/R2)**2 +
        (-R1*R3*SR2/R2**2)**2 +
        (R3*SR1/R2)**2

    )

    # Відносна похибка RX у відсотках
    relivate_result = math.sqrt(

        (SR3/R3)**2 +
        (-SR2/R2)**2 +
        (SR1/R1)**2

    ) * 100

    # Повернення результатів
    return absolute_result, relivate_result

# Вивід результатів
print(f"Абсолютна похибка R1 = {round(R1_mistake()[0], 2)} Ом, Відносна похибка R1 = {round(R1_mistake()[1], 2)} %")
print(f"Абсолютна похибка RX = {round(RX_mistake()[0], 2)} Ом, Відносна похибка RX = {round(RX_mistake()[1], 2)} %")