import numpy as np # Бібліотека numpy для обробки масивів даних

# Сталі опори R3, R2
R3 = 2670.30
R2 = 1035.45

# Ініціалізація numpy матриці значень R1, тип даних - цілі числа
table_R1 = np.array([
    [1584, 1485, 1393, 1449, 1708],
    [1596, 1482, 1377, 1426, 1685],
    [1605, 1485, 1391, 1398, 1710],
    [1602, 1491, 1381, 1404, 1686],
    [1608, 1462, 1386, 1399, 1656]
], dtype = int)

# Визначення лямбда-функції, що множить кожен елемент матриці на (R3/R2)
f = lambda x: x * round(R3 / R2, 5)

# Застосування лямбда-функції до масиву R1: Тобто дістаємо матрицю значень RX
table_RX = f(table_R1)

# Виводимо матрицю значень RX
print(table_RX)

# Виводимо середні значення RX з кожного стовпця, тут
# enumerate -- генератор двох елементних кортежів: 1 елемент це нумерація, 2 середнє значення стовпцях
# np.mean -- метод для визначення середнього значення стовпця, де axis=0 -- це означає, що ми хочемо визначити середні значення саме ПО стовпцях
for i, avg in enumerate(np.mean(table_RX, axis=0), start=1): print(f"⟨R_{i}x⟩ = {avg:.2f}")